Repository: corapoid/UbiquitiProtectBar
Catalog: ProtectBar/Resources/*.lproj/Localizable.strings
Languages: pl

# connection.local
source: Local Network
pl: Sieć lokalna

# connection.local.description
source: Connect directly to your UniFi Protect NVR on your local network
pl: Połącz bezpośrednio z rejestratorem UniFi Protect w sieci lokalnej

# settings.title
source: Settings
pl: Ustawienia

# settings.connection_type
source: Connection Type
pl: Typ połączenia

# settings.nvr_address
source: NVR Address
pl: Adres NVR

# settings.nvr_address.placeholder
source: 192.168.1.1 or hostname
pl: 192.168.1.1 lub nazwa hosta

# settings.authentication
source: Authentication
pl: Uwierzytelnianie

# settings.api_key
source: API Key
pl: Klucz API

# settings.api_key.hint
source: UniFi OS Settings > API Access > Create Token
pl: UniFi OS Ustawienia > API Access > Create Token

# settings.username
source: Username
pl: Nazwa użytkownika

# settings.password
source: Password
pl: Hasło

# settings.stream_quality
source: Stream Quality
pl: Jakość strumienia

# settings.stream_quality.hint
source: Lower quality uses less bandwidth and CPU
pl: Niższa jakość zużywa mniej pasma i CPU

# settings.test_connection
source: Test Connection
pl: Testuj połączenie

# settings.save_connect
source: Save & Connect
pl: Zapisz i połącz

# settings.disconnect_clear
source: Disconnect & Clear
pl: Rozłącz i wyczyść

# quality.low
source: Low (360p)
pl: Niska (360p)

# quality.medium
source: Medium (720p)
pl: Średnia (720p)

# quality.high
source: High (1080p+)
pl: Wysoka (1080p+)

# grid.cameras_count
source: %d cameras
pl: Kamery: %d

# grid.loading
source: Loading cameras...
pl: Ładowanie kamer...

# grid.empty
source: No cameras available
pl: Brak dostępnych kamer

# grid.empty.hint
source: Check your NVR settings or enable RTSP
pl: Sprawdź ustawienia NVR lub włącz RTSP

# grid.refresh
source: Refresh
pl: Odśwież

# grid.unpin_all
source: Unpin All
pl: Odepnij wszystkie

# camera.hide
source: Hide Camera
pl: Ukryj kamerę

# camera.show
source: Show Camera
pl: Pokaż kamerę

# camera.pin
source: Pin to Desktop
pl: Przypnij do pulpitu

# camera.show_hidden
source: Show hidden cameras
pl: Pokaż ukryte kamery

# camera.hide_hidden
source: Hide hidden cameras
pl: Ukryj ukryte kamery

# layout.2_columns
source: 2 columns
pl: 2 kolumny

# layout.4_columns
source: 4 columns
pl: 4 kolumny

# layout.single_row
source: All in one row
pl: Wszystkie w jednym rzędzie

# error.invalid_url
source: Invalid NVR URL
pl: Nieprawidłowy adres NVR

# error.invalid_response
source: Invalid response from NVR
pl: Nieprawidłowa odpowiedź z NVR

# error.unauthorized
source: Invalid credentials or session expired.
pl: Nieprawidłowe dane logowania lub sesja wygasła.

# error.forbidden
source: Access denied (403). Account may be locked or IP blocked.
pl: Odmowa dostępu (403). Konto może być zablokowane lub IP zbanowane.

# error.rate_limited
source: Too many requests. Please wait a moment.
pl: Zbyt wiele zapytań. Poczekaj chwilę.

# error.http
source: HTTP error: %d
pl: Błąd HTTP: %d

# error.decoding
source: Failed to parse NVR response: %@
pl: Nie udało się przetworzyć odpowiedzi NVR: %@

# error.connection_failed
source: Connection failed: %@
pl: Połączenie nie powiodło się: %@

# error.help.unauthorized
source: Check your API key or credentials. For API key, generate a new one in UniFi OS Settings > API Access.
pl: Sprawdź klucz API lub dane logowania. Dla klucza API wygeneruj nowy w UniFi OS Ustawienia > API Access.

# error.help.forbidden
source: Your account may be temporarily locked due to failed login attempts. Wait a few minutes and try again.
pl: Twoje konto może być tymczasowo zablokowane z powodu nieudanych prób logowania. Poczekaj kilka minut i spróbuj ponownie.

# error.help.connection
source: Make sure you're connected to the same network as your NVR and the address is correct.
pl: Upewnij się, że jesteś połączony z tą samą siecią co NVR i że adres jest poprawny.

# status.connected
source: Connected
pl: Połączono

# status.connecting
source: Connecting...
pl: Łączenie...

# status.disconnected
source: Disconnected
pl: Rozłączono

# status.error
source: Error
pl: Błąd

# test.success
source: Connected! Found %d cameras.
pl: Połączono! Znaleziono %d kamer.

# test.failed
source: Connection failed
pl: Połączenie nie powiodło się

# menu.settings
source: Settings
pl: Ustawienia

# menu.quit
source: Quit
pl: Zakończ

# menu.check_updates
source: Check for Updates
pl: Sprawdź aktualizacje
